In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [2]:
# Read in csv
file1 = "../data/Natality, 2016-2019 expanded (7).csv"

In [3]:
table = pd.read_csv(file1)
dict = { "Year": 'year',
    "State of Residence":"state",
   
    "Births": 'births',
       }

table.rename(columns = dict, inplace = True)
table

      id  year          state  births
0      1  2016        Alabama   59151
1      2  2016         Alaska   11209
2      3  2016        Arizona   84520
3      4  2016       Arkansas   38274
4      5  2016     California  488827
..   ...   ...            ...     ...
199  200  2019       Virginia   97429
200  201  2019     Washington   84895
201  202  2019  West Virginia   18136
202  203  2019      Wisconsin   63270
203  204  2019        Wyoming    6565

[204 rows x 4 columns]

In [ ]:
2019= [
58615,
9822,
79375,
36564,
446479,
62869,
34258
10562,
9079,
220002,
126371,
16797,
22063,
140128,
80859,
37649,
35395,
53069,
58941,
11772,
70178,
69117,
107886,
66027,
36636,
72127,
11079,
24755,
35072,
11839,
99585,
22960,
221539,
118725,
10454,
134461,
49143,
41858,
134230,
10175,
57038,
11449,
80450,
377599,
46826,
5360,
97429,
84895,
18128,
63270,
6565 ]

# Extract and Load into Postgres(Heroku)

In [60]:
#import necessary modules

import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
from sqlalchemy.sql import text
from sqlalchemy.orm import sessionmaker

from flask import Flask, jsonify

connection_string = "postgresql://postgres:postgres@localhost:5432/BirthRate"
engine = create_engine(f'{connection_string}')

In [61]:
tableData = '''
    create table tableData(
    id integer primary key,
    state varchar(100),
    year integer , 
    births integer
     )
'''

In [62]:
tables = {
          'tableData' : tableData.strip()          
         }

In [63]:
for table in tables.keys():
    print(f'dropping the table {table} if it already exists...')
    engine.execute(f'drop table IF EXISTS {table}')

dropping the table tableData if it already exists...

In [64]:
for table , script in tables.items():
    print(f'creating the table {table}...')
    engine.execute(f'{script}')

creating the table tableData...

In [65]:
table.to_sql(name='tableData', con=engine, if_exists='append', index=False)

AttributeError: 'str' object has no attribute 'to_sql'